# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
np.random.seed(63)
series1 = pd.Series(np.random.randint(1, 5, 100))
series2 = pd.Series(np.random.randint(1, 4, 100))
series3 = pd.Series(np.random.randint(10000, 31000, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [28]:
df = pd.concat([series1, series2, series3], axis=1)
df.head(8)

   0  1      2
0  1  3  14034
1  1  1  13559
2  4  3  24409
3  4  1  23310
4  3  1  14128
5  1  2  30341
6  2  2  21201
7  1  3  14229

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [31]:
df.columns = ["bedrs", "bathrs", "price_sqr_meter"]
df.head(8)

   bedrs  bathrs  price_sqr_meter
0      1       3            14034
1      1       1            13559
2      4       3            24409
3      4       1            23310
4      3       1            14128
5      1       2            30341
6      2       2            21201
7      1       3            14229

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'big_column'

In [38]:
big_column = pd.concat([series1, series2, series3], axis=0)
type(big_column)

pandas.core.series.Series

In [42]:
big_column = pd.DataFrame(big_column)
type(big_column)

pandas.core.frame.DataFrame

In [49]:
big_column.head()

   0
0  1
1  1
2  4
3  4
4  3

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [44]:
big_column.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [46]:
big_column.reset_index(drop=True, inplace=True)

In [48]:
big_column.tail(30)

         0
270  29413
271  15090
272  25723
273  26930
274  29340
275  27332
276  26112
277  13611
278  23730
279  22651
280  19641
281  28828
282  11019
283  14835
284  25750
285  30253
286  20038
287  12258
288  28961
289  12241
290  27046
291  18599
292  10506
293  19033
294  20774
295  21335
296  26212
297  15509
298  20741
299  22813